app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('laptop', '2025-08-12 08:13:22.242895', '2025-08-12 08:13:22.242895') RETURNING "id"

  def destroy
    @category.destroy!
---
DELETE FROM "categories" WHERE "categories"."id" = 3

    def set_category
      @category = Category.find(params.expect(:id))
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 2 LIMIT 1