app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "category_id", "created_at", "updated_at") VALUES ('jarum', 4333.0, 1, '2025-08-12 08:46:22.187320', '2025-08-12 08:46:22.187320') RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = 'plierss', "updated_at" = '2025-08-12 08:42:42.152129' WHERE "products"."id" = 3
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = 3
---
  def destroy
    @product.destroy!

SELECT products.*, categories.name as category_name, "products"."id" AS t0_r0, "categories"."id" AS t1_r0, "categories"."name" AS t1_r1, "categories"."created_at" AS t1_r2, "categories"."updated_at" AS t1_r3 FROM "products" LEFT OUTER JOIN "categories" ON "categories"."id" = "products"."category_id"
---
  def know
    @product = Product.joins(:category).select("products.*, categories.name AS category_name")

SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
---
    def set_product
      @product = Product.find(params.expect(:id))