app/views/categories/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."category_id" = 1
---
<ul>
  <% @category.products.each do |product| %>